{
    "main_title": "زول مطور {pipe} مختار سليمان {pipe} موقع مطور ويب ",
    "main_description": "مطور ويب للواجهة الأمامية و Frontend. متخصص في JavaScript {pipe} Vue.js {pipe} React.js {pipe} اقيم في مدينة نانت ، فرنسا  .وخريج معهد وأدوات تطوير الويب الأخرى OpenClassrooms",
    "logo_img_desc": "شعار زول ديفالبر",
    "home_title": "الصفحة الرئيسية",
    "home_path": "/",
    "skills_title": "المهارات",
    "skills_path": "#skills",
    "portfolio_title": "الأعمال",
    "portfolio_path": "#portfolio",
    "education_title": "التعليم",
    "education_path": "#education",
    "contact_title": "تواصل معنا",
    "contact_path": "#contact",
    "network_aria_label": "{iconName} رابط الي حساب مختار في",

    "main_heading": {
        "static_desc": "أهلًا ومرحبًا | انا | مختار",
        "dynamic_desc": " مطور ويب |  Frontend"
    },
    "description_info": {
        "main": "فضولي وشغوف بعالم التكنولوجيا وبشكل خاص تطوير مواقع الويب. لقد مرت أكثر من عام منذ ان قررت  إتخاذ الخطوة وأخذ الوقت الكافي لتدريب نفسي. لذلك انضممت إلى معهد اوبين كلاسروم في يوليو ٢٠٢١ من أجل تحسين مهاراتي واكتساب معرفة جديدة.",
        "additional": "ابحث حاليا | عن شركة لابرام عقد عمل ودراسة كمطور ويب شامل (Fullstack developer). اتمتع بإنضباط ودقة عالية. أعرف كيف أكون شخصا مستقلاً في مهماتي ومبدعًا في إنجازاتي من أجل توسيع نطاق مهاراتي ومصاحبة مشاريعك في عالمنا الرقمي الرائع.",
        "button": "المزيد من المعلومات | القليل من المعلومات"
    },
    "hero_img_desc": "صورة مختار سليمان",
    "arrow_navigation_to_bottom": "انقر للإنتقال إلى أسفل الصفحة",
    "skills_main_title": "المهارات",
    "tools_alt_desc": "أيقونة",
    "download_resume": "تحميل السيرة الذاتية ",
    "portfolio": {
        "meta": {
            "page_title": "معلومات المشروع",
            "page_description": "ستجد هنا معلومات مفصلة عن كل مشروع"
        },
        "heading": {
            "main": "أعمالي",
            "navigational_title": "مشاريع الويب | التصاميم",
            "context": "السياق",
            "technology": "التقنيات المستخدمة"
        },
        "project1": {
            "type": "الفنادق  والأنشطة",
            "brief_description": "هذا الموقع عبارة عن منصة خيالية لتأجير المساكن وتخطيط الرحلات السياحية.",
            "main_description": "تم تنفيذ المشروع الأول كجزء من تدريبي السابق  في معهد OpenClassrooms. | Réservia هو نموذج أولي لحجز فندق عبر الإنترنت يتضمن إنشاء موقع ويب ثابت باستخدام HTML5 و CSS3 وفقًا لواجهة مستخدم متجاوب. | null",
            "alt_main_image": "réservia مشروع"
        },
        "project2": {
            "type": "حجز الطلبات",
            "brief_description": "مفهوم يتيح للأشخاص الراغبين بالذهاب الي المطاعم بتكوين قوائم الطعام بشكل مسبق.",
            "main_description": "هذا المشروع عبارة عن نموذج أولي يمثل منصة حجز وجبات عبر الإنترنت. يسمح لك بإدراج قوائم المطاعم الذواقة. تم تطوير هذا المشروع باستخدام معالج CSS المسبق (SASS) مع اتطباع نهج الهاتف المحمول أولاً. | null | null",
            "alt_main_image": "ohmyfood مشروع"
        },
        "project3": {
            "type": "تحسين محركات البحث",
            "brief_description": "التدقيق والمراجعة الكاملة  لموقع ويب موجود من اجل تحسين نتائج البحث  (SEO).",
            "main_description": "هذا المشروع تم تطويره من قبل ولكن لديه العديد من المشاكل التي تتعلق بتحسين محركات البحث. | لذلك تم تحليل الموقع وتحسينه عن طريق تقليل وقت التحميل واعتماد ممارسات تحسين محركات البحث وإمكانية الوصول الجيدة. | تم ايضا إعداد تقرير التحسين للإشارة إلى نتائج ما قبل وما بعد التحسين.",
            "alt_main_image": "la chouette agence مشروع"
        },
        "project4": {
            "type": "التجارة الإلكترونية",
            "brief_description": "إنشاء موقع التجارة الإلكترونية كنموذج اولي MVP.",
            "main_description": "Orinoco هو عبارة عن منتج الحد الأدنيMVP لموقع التجارة الإلكترونية الذي تم إنشاؤه بمفهوم المنتج الأحادي. | تم تطوير الواجهة الأمامية باستخدام JavaScript الخالص. ثم تم دمج العناصر من خلال واجهة برمجة التطبيقات التي تمت تقديمه. كما تم وضع خطة اختبار الوحدة (unit test) لضمان التشغيل السليم. | null",
            "alt_main_image": "orinoco مشروع"
        },
        "project5": {
            "type": "التقيمات والمراجعات",
            "brief_description": "تطوير واجهة برمجية (API)  لتطبيق مراجعات وتقييمات الطعام.",
            "main_description": "Hot Takes هو تطبيق ويب  وتقييمات الطعام. كان الهدف هو إنشاء واجهة برمجة تطبيقات REST آمنة تحترم قوانين ومعايير OWASP وتسمح للمستخدمين بإضافة الصلصات المفضلة لديهم وإبداء الإعجاب أو عدم الإعجاب بالصلصات التي يشاركها الآخرون. | لذلك استخدمت إطار العمل Express لتعريف او لتحديد نمط MVC ، و Postman كعميل REST و MogoDB كنظام إدارة قاعدة البيانات (DBMS). | null",
            "alt_main_image": "hot takes مشروع"
        },
        "project6": {
            "type": "التواصل الإجتماعي",
            "brief_description": "إنشاء منصة شبكة اجتماعية تتيح للموظفين بمشاركة الموضوعات التي يهتمون بها.",
            "main_description": "Groupomania هو مشروع Fullstack متكامل. كان الهدف هو إنشاء منصة شبكة اجتماعية داخلية للشركة تتيح للموظفين بإنشاء حسابات شخصية ونشر محتوى متعدد الوسائط  والتفاعل مع المحتوى الذي يشاركه الآخرون. | تم بناء الواجهة الأمامية بإستخدام Vue 3 مع دمج Vuex لإدارة حالة العناصر و Axios لإرسال طلبات http وأخيراً استخدام SASS كمعالج أولي (CSS). | في  ال back-end ، استخدمت Express كنموذج MVC مع دمج مكتبات خارجية. و MySql كنظام لإدارة قواعد البيانات (DBMS).",
            "alt_main_image": "groupomania مشروع"
        },
        "project7": {
            "type": "مدير المهام",
            "brief_description": "برنامج مدير مهام مصغرة يتيح لك بجدولة ومتابعة مهامك الشخصي.",
            "main_description": "Task-tracker هو تطبيق صغير لتعقيب المهام الشخصي. تم إنشاؤه باستخدام React و json-server db. يتيح لك التطبيق بشكل أساسي إضافة المهام، مطابعة حالتها وحذفها بشكل نهائي. | تم تطوير واستضافة هذا المشروع باستخدام React و Github pages.",
            "alt_main_image": "tasck-tracker مشروع"
        },
        "project8": {
            "type": "متجر إلكتروني",
            "brief_description": "متجر نباتات إلكتروني  يسرد فئات مختلفة من النباتات المنزلية .",
            "main_description": "المشروع هو عبارة عن متجر نباتات بسيط عبر الإنترنت يسمح لك بإضافة نباتات إلى عربة التسوق وتصفيتها عن طريق تحديد فئة معينة من النباتات. | تم تطوير واستضافة هذا المشروع باستخدام React و pages Github. | null",
            "alt_main_image": "the jungle house مشروع"
        },
        "project9": {
            "type": "أحوال الطقس",
            "brief_description": "تطبيق يتيح لك عرض الطقس الحالي وتوقعات احوال الطقس باليوم والساعة.",
            "main_description": "إنه برنامج احوال الطقس التي تم إنشاؤه باستخدام  React و Tailwind وخدمة Openweathermap API. | يتيح لك التطبيق بعرض توقعات الطقس بالساعة واليوم والطقس الحالي عن طريق تحديد إحدى المدن المحددة مسبقًا أو عن طريق إدخال اسم أي مدينة من اختيارك ، أو حتى عن طريق تحديد موقعك الحالي ، والذي يعتمد على إحداثيات خطوط الطول والعرض . لديك أيضًا إمكانية التبديل بين الوحدات المئوية والفهرنهايت. | null",
            "alt_main_image": "weather-app مشروع"
        },
        "project10": {
            "type": "الألعاب",
            "brief_description": "لعبة نرد تسمح لك بدحرجة 10 أرقام بشكل عشوائي تتراوح قيمتها بين 1-6.",
            "main_description": "هذه لعبة Tenzi التي تعرض لك 10 ظهرة نرد بشكل عشوائي بقيمة تتراوح بين 1 و 6  أكيد طبعاً! بمجرد تحديد احجار النرد المرغوبة ، يمكنك عرض احجار جديدة عن طريق دحرجة الزر. تنتهي اللعبة بمجرد اختيار 10 ظهرة نرد لهما نفس القيمة. | تم تطوير واستضافة هذا المشروع باستخدام React وصفحات Github. | null",
            "alt_main_image": "tenzies-game مشروع"      
        },
        "project11": {
            "type": "إيجار الشقق",
            "brief_description": "إنشاء موقع  لتأجير الشقق بإستخدام نظام إدارة المحتوي  Wordpress.",
            "main_description": " MP House Location هو عبارة عن موقع  استعراض متخصص في تأجير الشقق والتي تم تطويره باستخدام نظام إدارة المحتوى (CMS). | مبدعياً تم تصميم المشروع تحت منصة Figma ، ثم تم تطويره باستخدام نظام إدارة المحتوى Wordpress. لذلك اخترت نموذج Astra لمرونتها ومنشئ الصفحات Elementor لسلالتها. | null",
            "alt_main_image": "mp house location مشروع"
        },
        "project12": {
            "type": "حافظة أعمال",
            "brief_description": "هذا المشروع هو عبارة عن موقع الويب الخاص بي الذي تم تطويره بإستخدام NuxtJS.",
            "main_description": "هذا المشروع هو ببساطة الموقع الذي تتصفحه عليه حاليًا. | تم تصميم هذه المحفظة تحت منصة Figma. بعد ذلك ، تم تنفيذ جزء التطوير بإستخدام  Nuxt 3 meta-framework و TypeScript و SASS. | في الجانب الـ back-end، كان استخدام Nodemailer مع دمج  بروتوكول Oauth2 الخاص بواجهة برمجة تطبيقات Google كان ضروريًا لإدارة إعادة التوجيه ومصادقة  الرسائل البريدية.",
            "alt_main_image": "zool developer مشروع"
        },
        "btn": {
            "read_more": "اقرأ المزيد ",
            "load_more_less": "تحميل المزيد | إظهار أفل",
            "demo": "عرض | التصميم",
            "see_source_code": "رؤية الكود المصدري | رؤية التصميم"
        },
        "design_project": {
            "alt_image": "{ project } لمحة من مشروع"
        }
    },
    "education": {
        "main_title": "المسيرة التعليمية",
        "level1": {
            "institution": "2022 | OpenClassrooms",
            "degree": "مطور ويب ـ بوت كامب"
        },
        "level2": {
            "institution": "2021 | Codecademy",
            "degree": "مطور ويب  ـ  تعليم ذاتي"
        },
        "level3": {
            "institution": "2019 | FCMP",
            "degree": "كهربائي  ـ  تأهيل"
        },
        "level4": {
            "institution": "2013 | Al-Taliah",
            "degree": "شهادة ثانوية"
        },
        "languages": "إنجليزي | فرنسي | عربي"
    },
    "contact": {
        "title": {
            "main": "معلومات التواصل",
            "social_media": "الشبكات الإجتماعية"
        },
        "description": { 
            "two_first_lines": " لديك مشروع ؟  أو لديك فكرة ؟ | أو مجرد نصيحة ؟", 
            "two_last_lines": "إذاً لا تترد بالتواصل معي بالطريقة  |! التي تناسبك"
        },
        "fullName_input": {
            "label": "الإسم بالكامل",
            "placeholder": "أحمد ادم"
        },
        "email_input": {
            "label": "البريد الإلكتروني ",
            "placeholder": "example{at}gmail.com"
        },
        "subject_input": {
            "label": "الموضوع",
            "placeholder": "عنوان الموضوع "
        },
        "textarea_input": {
            "label": "الرسالة ",
            "placeholder": "اكتب رسالتك..."
        },
        "submit_btn": "إرسال"
    },
    "footer": {
        "copyright": "جميع الحقوق محفوظة"
    },
    "errors": {
        "title": "خطأ",
        "server_side": {
            "main_message": "هنالك مشكلة في الخادم!",
            "additional_info": "سنحاول حل هذه المشكلة في اقرب وقت ممكن."
        },
        "client_side": {
            "main_message": "الصفحة غير موجودة!",
            "additional_info": "لم يتم الوصول الي الصفحة التي طلبتها."
        },
        "else": {
            "main_message": "لدينا مشكلة!",
            "additional_info": "تواصل معنا لإخطارنا عن هذه المشكلة."
        },
        "btn": "العودة الي الصفحة الرئيسية"
    }
}