{    
    "main_title": "Zool Developer {pipe} Mukhtar Sulaiman {pipe} Web Developer Portfolio",
    "main_description": "Front-end and Fullstack web developer. Specialized in JavaScript {pipe} Vue.js {pipe} React.js {pipe} Node.js. Based in Nantes, France and alumnus of OpenClassrooms",
    "logo_img_desc": "zool developer logo",
    "home_title": "Home",
    "home_path": "/",
    "skills_title": "Skills",
    "skills_path": "#skills",
    "portfolio_title": "Portfolio",
    "portfolio_path": "#portfolio",
    "education_title": "Education",
    "education_path": "#education",
    "contact_title": "Contact",
    "contact_path": "#contact",
    "network_aria_label": "link to Mukhtar's {iconName} account",

    "main_heading": {
        "static_desc": "Hello and welcome ! | My name's | Mukhtar",
        "dynamic_desc": "I am a | Fullstack Developer"
    },
    "description_info": {
        "main": "Curious and passionate about the world of tech and more particularly web development. It's been over a year since I've decided to take the step and take the time to train myself. I therefore joined the OpenClassrooms program in July 2021 in order to perfect my knowledge and acquire new ones.",
        "additional": "Currently | looking for a company for a work-study contract as Full stack web Developer or a React JavaScript Developer. Endowed with great rigor and motivation, I know how to be autonomous in my missions and creative in my achievements in order to increase the volume of my skills and accompany you in this wonderful world which is tech.",
        "button": "More info | Less info"
    },
    "hero_img_desc": "Mukhtar Sulaiman's image",
    "arrow_navigation_to_bottom": "Click to go to the bottom of the page",
    "skills_main_title": "Skills",
    "tools_alt_desc": "icon",
    "download_resume": "Download my resume",
    "portfolio": {
        "meta": {
            "page_title": "Project information",
            "page_description": "Here you will find detailed information about each project"
        },
        "heading": {
            "main": "Portfolio",
            "navigational_title": "Web Projects | Designs",
            "context": "Context",
            "technology": "technology"
        },
        "project1": {
            "type": "Hotels & entrtainment",
            "brief_description": "This is an imaginary site for renting housing and planning tourist trips.",
            "main_description": "First project carried out as part of my previous bootcamp training at OpenClassrooms. | Réservia is a prototype of an online hotel booking that involves to create a static website using HTML5 and CSS3 according with a responsive iterface. | null",
            "alt_main_image": "Reservia project"
        },
        "project2": {
            "type": "Meal reservation",
            "brief_description": "A concept that allows users to compose their menu beforehand.",
            "main_description": "This project is a prototype that represents an online meal resveration platform. It allows you to list the menus of gourmet restaurants. The project was developed using the CSS preprocessor (SASS) with the mobile-first approach. | null  | null",
            "alt_main_image": "Ohmyfoof project"
        },
        "project3": {
            "type": "SEO",
            "brief_description": "Complete audit and improvement of the SEO of an existing website.",
            "main_description": "This is an already existing project that has many issues ralted to SEO. | The site has therefore been analyzed and improved by reducing loading time and adopting good SEO ans accessibility practices. | An optimisation report was also made to indicate the pre and post optimization results.",
            "alt_main_image": "La Chouette agence project"
        },
        "project4": {
            "type": "E-commerce",
            "brief_description": "Created an MVP of an e-commerce website.",
            "main_description": "Orinoco is an MVP of an e-commerce website that was built with the mono-product concept. | The front-end was developed using pure JavaScript. The elements are integrated throught a provied API. A unit testing plan has also been put in place to ensure proper functioning. | null",
            "alt_main_image": "Orinoco project"
        },
        "project5": {
            "type": "Reviews app",
            "brief_description": "Developed an API for a reviewes web application.",
            "main_description": "Hot Takes is a reviews web application. The goal was to create a secure REST API that respects both OWASP rules and allows users to add their favorite sauces and like or dislike the sauces that others share. | So I used Express framework to define the MVC pattern, Postman as a REST client and MogoDB as a database mangement system (DBMS). | null",
            "alt_main_image": "Piiquante project"
        },
        "project6": {
            "type": "Social media",
            "brief_description": "Built a company social network platform that allows employees to share topics that ther're passionate about.",
            "main_description": "Groupomania is a fullstack project. The goal was to create an internal corporate social network platform that allows employees to create personal accounts, post multimedia content and interact with content that others share. | The front-end was built under Vue 3 framework with the combination of Vuex for the state mangement, Axios for sending http requests and the implementation of SASS as a preprocessor (CSS). | In the back-end, I used Express as an MVC framework with the integration of third-party libraries. And MySql as a database mangement system (DBMS).",
            "alt_main_image": "Groupomania project"
        },
        "project7": {
            "type": "Tasck manger",
            "brief_description": "A mini task manager app that gives you the capability to add and track your tasks.",
            "main_description": "Task-tracker is a mini task manager app that has been created with React and json-server db. The app basically allows you to add tasks, track their state and remove them completely. | The development and hosting of the project were carried out with React and Github pages. | null",
            "alt_main_image": "task-tracker project"
        },
        "project8": {
            "type": "Online shop",
            "brief_description": "An online plant shop that lists different categories of plants.",
            "main_description": "The project is a simple online plant shop that allows you to add plants to cart and filtering them by selecting a specific category of plants. | The development and hosting of the project were carried out with React and Github pages. | null",
            "alt_main_image": "the house jungle project"
        },
        "project9": {
            "type": "Weather conditions",
            "brief_description": "An app that allows you to display the current weather and hourly & daily forecasts.",
            "main_description": "It's a weather app that was built using React, Tailwind, and the Openweathermap api service. | The app allows you to display the hourly and daily forecasts and the current weather by selecting one of the predefined cities or by entering the name of any city of your choice, or even by selecting your current location, which depends on the latitude and longitude coordinates. You also have the ability to toggle between Celsius and Fahrenheit units. | null",
            "alt_main_image": "weather-app project"
        },
        "project10": {
            "type": "Gaming",
            "brief_description": "A dice game that allows you to roll 10 random numbers bettwen 1 - 6.",
            "main_description": "It's a tenzies game that shows you 10 random dice with a value between 1 - 6 of course! Once you've selected the disered dice, you can display new ones by rolling the button. The game ends once you've selected the 10 dice that have the same value.| The development and hosting of the project were carried out with React and Github pages. | null",
            "alt_main_image": "tenzies game project"
        },
        "project11": {
            "type": "Housing Rental",
            "brief_description": "An appartment rental website created under the Wordpress CMS.",
            "main_description": "MP House location is an appartment rental showcase website that was developed with a content management system (CMS). | The project was first designed under Figma, then it was developed with the Wordpress CMS. So I chose the Astra theme for its flexibility and the Elementor page builder for its fluidity. | null",
            "alt_main_image": "mp house location project"
        },
        "project12": {
            "type": "Portfolio",
            "brief_description": "This is my own personal website which was developed under the NuxtJS meta-framework.",
            "main_description": "This project is simply the site you are currently on. | The design of this portfolio was made under Figma. Then, the development part was carried out under Nuxt 3 meta-framework, TypeScript and SASS. | In the back-end, the implementation of the Nodemailer with the combination of the Oauth2 protocol of Google API was necessary to manage the re-direction and the authentication of the mails.",
            "alt_main_image": "Zool developer website"
        },        
        "btn": {
            "read_more": "Read more",
            "load_more_less": "Show More | Show Less",
            "demo": "Demo",
            "see_source_code": "See source code"
        },
        "design_project": {
            "alt_image": "glimpse of the project { project }"
        }
    },
    "education": {
        "main_title": "Education",
        "level1": {
            "institution": "2022 | OpenClassrooms",
            "degree": "Web developer - Bootcamp"
        },
        "level2": {
            "institution": "2021 | Codecademy",
            "degree": "Self-taught web developer"
        },
        "level3": {
            "institution": "2019 | FCMP",
            "degree": "Electrician - Apprenticeship"
        },
        "level4": {
            "institution": "2013 | Al-Taliah",
            "degree": "High school degree"
        },
        "languages": "English | French | Arabic"
    },
    "contact": {
        "title": {
            "main": "Contact",
            "social_media": "Social networks"
        },
        "description": { 
            "two_first_lines": "A project ? An idea ? | Or simply an advice ?", 
            "two_last_lines": "Feel free to contact me by | the way that suits you !"
        },
        "fullName_input": {
            "label": "Full name",
            "placeholder": "David ALLAIN"
        },
        "email_input": {
            "label": "Email",
            "placeholder": "example{at}gmail.com"
        },
        "subject_input": {
            "label": "Subject",
            "placeholder": "Your subject"
        },
        "textarea_input": {
            "label": "Message",
            "placeholder": "Type your message..."
        },
        "submit_btn": "Submit"
    },
    "footer": {
        "copyright": "Copyright"
    }
}