{
    "main_title": "Zool Developer {pipe} Mukhtar Sulaiman {pipe} Portfolio Développeur Web",
    "main_description": "Développeur web Front-end et Fullstack. Spécialisé en JavaScript {pipe} Vue.js {pipe} React.js {pipe} Node.js. Basé à Nantes, France et ancien élève d'OpenClassrooms",
    "logo_img_desc": "logo zool developer",
    "home_title": "Accueil",
    "home_path": "/",
    "skills_title": "Compétences",
    "skills_path": "#skills",
    "portfolio_title": "Portfolio",
    "portfolio_path": "#portfolio",
    "education_title": "Formation",
    "education_path": "#education",
    "contact_title": "Contact",
    "contact_path": "#contact",
    "network_aria_label": "lien vers le compte {iconName} de Mukhtar",
   
    "main_heading": {
        "static_desc": "Bonjour et bienvenue ! | Moi c'est | Mukhtar",
        "dynamic_desc": "Je suis développeur | Full Stack"
    },
    "description_info": {
        "main": "Curieux et passionné par le monde de la tech et plus particulièrement par le développement web. Il y a un peu plus d’un an que j’ai décidé de sauter le pas et prendre le temps de m’auto-former. J’ai donc intégré en juillet 2021 l’école OpenClassrooms afin de parfaire mes connaissances et d’en acquérir de nouvelles.",
        "additional": "Actuellement | à la recherche d’une entreprise pour un contrat d’alternance en tant que Développeur d'Application - JavaScript React / Concepteur Développeur d’Applications. Doté d’une grande rigueur et de motivation, je sais être autonome dans mes missions et créatif dans mes réalisations afin d'agrandir le volume de mes compétences et vous accompagner dans ce monde merveilleux qu'est le numérique.",
        "button": "Plus d'info | Moins d'info"
    },
    "hero_img_desc": "image de Mukhtar Sulaiman",
    "arrow_navigation_to_bottom": "Cliquez pour aller en bas de la page",
    "skills_main_title": "Compétences",
        "tools_alt_desc": "îcone",
    "download_resume": "Télécharger mon CV",
    "portfolio": {
        "meta": {
            "page_title": "Informations du projet",
            "page_description": "Vous trouverez ici les informations de chaque projet de manière détaillé"
        },
        "heading": {
            "main": "Portfolio",
            "navigational_title": "Projets web | Designs",
            "context": "Contexte",
            "technology": "technologies"
        },
        "project1": {
            "type": "Hôtels & activités",
            "brief_description": "Il s'agit d'un site fictif de location de logements et planification de voyages touristiques.",
            "main_description": "Premier projet mené dans le cadre de ma précédente formation chez OpenClassrooms. Réservia est un prototype d'un site web de réservation d'hôtels en ligne. Il s'agit de coder un site web statique en utilisant HTML5 et CSS3 conformément à une interface responsive. | null | null",
            "alt_main_image": "Projet Réservia"
        },
        "project2": {
            "type": "Réservation de repas",
            "brief_description": "Un concept qui permet aux utilisateurs de composer leur menu de manière préalable.",
            "main_description": "Ce projet est un prototype qui représente une plate-forme de réservation de repas en ligne. Il permet de répertorier les menus de restaurants gastronomiques. Le projet a été développé en utilisant le préprocesseur de CSS (SASS) avec l'approche mobile-first. | null  | null",
            "alt_main_image": "Projet Ohmyfood"
        },
        "project3": {
            "type": "Référencement naturel",
            "brief_description": "Audit complet et amélioration du référencement (SEO) d'un site web existant.",
            "main_description": "Il s'agit d'un projet déjà existant mais il avait de problèmes liés au référencement naturel. | Le site a été donc analysé et amélioré en réduisant le temps de chargement et en appliquant les bonnes pratiques du SEO et d'accessibilité. | Un rapport d'optimisation a été également réalisé pour indiquer les résultats pré et post optimisation.",
            "alt_main_image": "Projet La Chouette agence"
        },
        "project4": {
            "type": "É-commerce",
            "brief_description": "Création d'un MVP d'un site e-commerce.",
            "main_description": "Orinoco est un MVP d'un site e-commerce qui a été réalisé avec le concept mono-produit. | Le front-end a été développé en utilisant pur JavaScript. Les éléments sont intégrés grâce à une API fournie. Un plan de test unitaire a été également mis en place pour assurer le bon fonctionnement.  | null",
            "alt_main_image": "Projet Orinoco"
        },
        "project5": {
            "type": "Avis critiques",
            "brief_description": "Développement d'une API pour une application d'avis gastronomiques.",
            "main_description": "Hot Takes est une application web d'avis critiques. Le but était de créer une API REST sécurisée qui respecte à la fois les règles de l'OWASP et permettant aux utilisateurs d'ajouter leurs sauces préférées et de liker ou disliker les sauces proposées par les autres utilisateurs. | J'ai donc utilisé le framework Express pour définir le modèle MVC, Postman comme un client REST et MongoDB en tant que système de guestion de base de données (SGBD). | null",
            "alt_main_image": "Projet Piiquante"
        },
        "project6": {
            "type": "Réseau social",
            "brief_description": "Création d'un réseau sociale d'entreprise qui permet aux employeurs de partager des sujets qui leur passionnent.",
            "main_description": "Groupomania est un projet fullstack. L'objectif était de créer un réseau social interne d'entreprise qui permet aux employé(es) de créer des comptes personnels, poster de contenu multimédia et interagir au contenu que d'autres partagent. | Le front-end de projet a été réalisé sous le framework Vue 3 avec la combinaison de Vuex pour la guestion d'état, Axios pour l'envoi des requpêts http et l'implémentation de SASS en tant que préprocesseur (CSS). | En back-end, j'ai utlisé Express comme un MVC framework avec l'intégration de bibliothèques tierces. Et MySql en tant que système de guestion de base de données (SGBD).",
            "alt_main_image": "Projet Groupomania"
        },
        "project7": {
            "type": "Gestionnaire de tâches",
            "brief_description": "Une mini application de gestion de tâches qui vous permet de planifier et de suivre vos tâches.",
            "main_description": "Task-tracker est une mini application de suivi de tâches qui a été créée avec React et json-server db. L'application vous permet essentiellement d'ajouter des tâches, de suivre leur état et de les supprimer définitivement. | Le développement et l'hérbergement du projet ont été réalisé avec React et Github pages. | null",
            "alt_main_image": "projet tasck-tracker"
        },
        "project8": {
            "type": "Boutique en ligne",
            "brief_description": "Une boutique de plantes en ligne qui répertorie différentes catégories de plantes.",
            "main_description": "Le projet est une simple boutique de plantes en ligne qui vous permet d'ajouter des plantes à votre panier et de les filtrer en sélectionnant une catégorie spécifique de plantes. | Le développement et l'hérbergement du projet ont été réalisé avec React et Github pages. | null",
            "alt_main_image": "projet the house jungle"
        },
        "project9": {
            "type": "Conditions météo",
            "brief_description": "Une application qui vous permet d'afficher la météo actuelle et prévisions horaires et journalières.",
            "main_description": "Il s'agit d'une application météo qui a été créée à l'aide de React, Tailwind et le service API d'Openweathermap. | L'application vous permet d'afficher les prévisions horaires et quotidiennes et la météo actuelle en sélectionnant l'une des villes prédéfinies ou en entrant le nom de n'importe quelle ville de votre choix, ou même en sélectionnant votre position actuelle, qui dépend des coordonnées de latitude et de longitude . | Vous avez également la possibilité de basculer entre les unités Celsius et Fahrenheit. | null",
            "alt_main_image": "projet weather-app"
        },
        "project10": {
            "type": "Gaming",
            "brief_description": "Un jeu de dés qui vous permet de lancer 10 chiffres de manière aléatoire avec une valeur entre 1-6.",
            "main_description": "Il s'agit d'un jeu de Tenzi qui vous affiche 10 dés de manière aléatoire avec une valeur entre 1 et 6 bien sûr ! Une fois que vous avez sélectionné les dés souhaités, vous pouvez en afficher de nouveaux en faisant rouler le bouton. Le jeu se termine une fois que vous avez sélectionné 10 dés qui ont la même valeur. | Le développement et l'hérbergement du projet ont été réalisé avec React et Github pages.  | null",
            "alt_main_image": "projet tenzies game"
        },
        "project11": {
            "type": "Location logement",
            "brief_description": "Un site vitrine de location de logements crée sous le CMS Wordpress.",
            "main_description": "MP House location est un site vitrine de location de logements qui a été développé avec un système de gestion de contenu (SGC). |  Le projet a été premièrement conçu sous Figma, puis il a été développé avec le SGC Wordpress. J'ai donc choisi la thème Astra pour sa flexibilité et le constructeur de page Elementor pour sa fluidité. | null",
            "alt_main_image": "projet mp house location"
        },
        "project12": {
            "type": "Portfolio",
            "brief_description": "Il s'agit de mon propre site web personel qui a été développé sous le meta-framework NuxtJS.",
            "main_description": "Ce projet est tout simplement le site sur lequel vous vous trouvez actuellement. | La conception de ce portfolio a été faite sous Figma. Ensuite, la partie développement a été réalisé avec le meta-framework Nuxt 3, TypeScript et SASS. | En back-end, l'implémentation du Nodemailer avec la combinaison du protocole Oauth2 de Google API était nécessaire pour gérer la ré-direction et l'authentification des mails.",
            "alt_main_image": "projet Zool Developer"
        },
        "btn": {
            "read_more": "En savoir plus",
            "load_more_less": "Afficher Plus | Afficher Moins",
            "demo": "Démo",
            "see_source_code": "Voir code source"
        },
        "design_project": {
            "alt_image": "aperçu du projet { project }"
        }
    },
    "education": {
        "main_title": "Formation",
        "level1": {
            "institution": "2022 OpenClassrooms",
            "degree": "Développeur web - Bootcamp"
        },
        "level2": {
            "institution": "2021 Codecademy",
            "degree": "Développeur web - Autodidacte"
        },
        "level3": {
            "institution": "2019 FCMP",
            "degree": "CAP Électricien - Alternance"
        },
        "level4": {
            "institution": "2013 Al-Taliah",
            "degree": "Baccalauréat général"
        },
        "languages": "Anglais | Français | Arabe"
    },
    "contact": {
        "title": {
            "main": "Contact",
            "social_media": "Réseaux sociaux"
        },
        "description": { 
            "two_first_lines": "Un projet ? Une idée ? | Ou simplement un conseil ?", 
            "two_last_lines": "N'hésitez pas à me contacter par | le moyen qui vous convient !"
        },
        "fullName_input": {
            "label": "Nom",
            "placeholder": "David ALLAIN"
        },
        "email_input": {
            "label": "Email",
            "placeholder": "example{at}gmail.com"
        },
        "subject_input": {
            "label": "Objet",
            "placeholder": "Votre sujet"
        },
        "textarea_input": {
            "label": "Message",
            "placeholder": "Ecrivez votre message..."
        },
        "submit_btn": "Envoyer"
    },
    "footer": {
        "copyright": "Tous droits réservés"
    }
}